// 2023年06月30日

class Bank {
    private int sum = 0;

    public synchronized void add(int a) {
        int tmp = sum;

        System.out.println("現在: " + tmp);
        System.out.println("入金: " + a);

        tmp += a;

        System.out.println("更新後: " + tmp);

        sum = tmp;
    }
}

class Customer implements Runnable {
    private Bank bank;

    public Customer(Bank  b) {
        bank = b;
    }

    @Override
    public void run() {
        for (int i = 0; i < 3000; i++) {
            bank.add(500);
        }
    }
}

public class Kadai11b {
    public static void main(String[] args) {
        Bank bank = new Bank();

        Customer c1 = new Customer(bank);
        Thread th1 = new Thread(c1);
        th1.start();

        Customer c2 = new Customer(bank);
        Thread th2 = new Thread(c2);
        th2.start();

        Customer c3 = new Customer(bank);
        Thread th3 = new Thread(c3);
        th3.start();
    }
}

/* 実行結果1 *******************************************************
現在: 1499500
入金: 500
更新後: 1500000
*******************************************************************/

/* 実行結果1 *******************************************************
現在: 1499500
入金: 500
更新後: 1500000
*******************************************************************/

/* 実行結果1 *******************************************************
現在: 1499500
入金: 500
更新後: 1500000
*******************************************************************/

/* 実行結果1 *******************************************************
現在: 1662500
入金: 500
更新後: 1663000
*******************************************************************/

/* 実行結果1 *******************************************************
現在: 1648500
入金: 500
更新後: 1649000
*******************************************************************/

/* 実行結果2 *******************************************************
現在: 2999500
入金: 500
更新後: 3000000
*******************************************************************/

/* 実行結果3 *******************************************************
現在: 4499500
入金: 500
更新後: 4500000
*******************************************************************/
